Notes/IOT-and-Embdded/Module-1/Module-1.tex
% Created 2023-03-16 Thu 10:51
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Sai Nishwanth Raj Reddy}
\date{\today}
\title{Module 1}
\hypersetup{
 pdfauthor={Sai Nishwanth Raj Reddy},
 pdftitle={Module 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{IOT}
\label{sec:orgb897077}

\subsection{How IOT Works?}
\label{sec:org39c06b0}
\begin{enumerate}
\item Sensors
\begin{itemize}
\item Collecting data
\end{itemize}
\item Connectivity
\begin{itemize}
\item Sending data to the cloud
\end{itemize}
\item Data Processing
\begin{itemize}
\item Making the Data Useful
\end{itemize}
\item User interface
\begin{itemize}
\item Delivering the information to the user
\end{itemize}
\end{enumerate}

\subsection{Definition of IOT}
\label{sec:org542b5a7}
``IOT is an umbrella term that refers to the billions of physical devices connected
to the internet, all collecting and exchanging data with one another.''

\subsection{Types of IOT}
\label{sec:org67e83e0}

\begin{itemize}
\item Consumer IOT
\begin{itemize}
\item IOT for everyday use
\end{itemize}
\item Commercial IOT
\begin{itemize}
\item Healthcare and Transport industries
\end{itemize}
\item IoMT (Military)
\begin{itemize}
\item Used in the Military field
\end{itemize}
\item IIoT (Industrial)
\begin{itemize}
\item Manufacturing and Energy sectors
\end{itemize}
\item Infrastructure IoT
\begin{itemize}
\item Connectivity in smart cities
\end{itemize}
\end{itemize}

\subsection{Why is IOT Important}
\label{sec:org78733d0}

\begin{enumerate}
\item Generates new Business Models
\item Data driven business decisions from IoT data
\item Increase productivity and efficiency
\item Enhances customer experience
\end{enumerate}

\subsection{Examples of IOT Devices}
\label{sec:orgbedac2b}

\begin{itemize}
\item Home Security
\item Activity Trackers
\item Home appliances
\end{itemize}

\subsubsection{Popular IoT Devices}
\label{sec:org6fae521}

\begin{itemize}
\item Google Home voice controller
\item Amazon Echo
\item August Doorbell cams
\item Foobot (Air Quality checker)
\end{itemize}

\subsection{Characteristics and Architecture of IOT Devices}
\label{sec:orga1b23dc}

\subsubsection{Connectivity}
\label{sec:org0bd6546}
\subsubsection{Intelligence and identity}
\label{sec:org833958c}
\subsubsection{Scalability}
\label{sec:orga0a1f38}
\begin{itemize}
\item They should be able to connect to multiple devices
\end{itemize}
\subsubsection{Self-Adjusting}
\label{sec:orgfd53279}
\subsubsection{Architecture}
\label{sec:org32628a5}
\begin{itemize}
\item IoT Devices should support devices from different manufacturers and their protocols
\end{itemize}
\subsubsection{Safety}
\label{sec:org852fb8e}
\begin{itemize}
\item Securing User Information from threats
\end{itemize}
\subsubsection{Self Configuring}
\label{sec:orgfcd65f3}
\begin{itemize}
\item Automatically updating their software, connecting to devices, etc
\end{itemize}

\subsection{4-stage Architecture of IoT}
\label{sec:org321bad9}
(Bottom to top)
\begin{enumerate}
\item Sensing layer
\item Network Layer
\item Data Processing Layer
\item Application Layer
\end{enumerate}
\end{document}